Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 他倒是不怕水晶球会坏掉，有了这两道高级魔纹的保护，别说是他，就算是安度因来，恐怕也没本事把水晶球弄坏。
en_us: He was not afraid that the crystal ball would break. With the protection of the two mageweath, even if Andoine had been here, he probably wouldn't have been able to break the crystal ball as well.

source: 他倔强地高扬着他那隐隐觉得越来越沉重的头，无视旁人怪异的眼神，一步一挨、一瘸一拐地往家里走。一路上巨大的疼痛让他原本清秀稚嫩的脸庞痛得无比扭曲，眼中满是怨恨……
en_us: Despite feeling even more lightheaded, he stubbornly kept his head held up high. Step by step, Jiang Yi limped back home, ignoring his surroundings. All throughout the long, painful journey, his dark eyes smoldered with fire and fury, and the immense agony left his delicate, supple face distorted in a frightening grimace.

source: 他内心暗暗叫苦，虽然对方认出他是江家的子弟，今日绝对不敢打死他的。但这事要是闹开了，被家族刑堂知道了，他被责罚一顿是小事，小奴败坏家族声誉怕是要被活活打死啊……
en_us: He grumbled bitterly in his mind. Although the housekeeper recognized that he was a member of the Jiang Clan and was certainly didn't dare to beat him to death; however, should the incident that day get publicized, and should the Jiang Clan Disciplinary Court find out... It was a small matter for him to get punished, but he was afraid that Xiaonu would be beaten to death for damaging the family's reputation...

source: 他内心沉喝一声，下意识的去调集黑色元力，让他震愕的是，一缕黑色元力瞬间从丹田内运转出来，流转到经脉。
en_us: he shouted loudly in his heart, setting his mind to summon and assemble his black essence forces. What left him excited and bewildered was that a wisp of black essence force circulated out of his dantian in an instant, and flowed towards his meridians.

source: 他内视了一下伤口，心情很快多云转晴。就这么一点时间，伤口恢复的速度已经赶上了他打坐运功疗伤两三个时辰了。如果此刻有足够的黑色元力，估计半炷香时间就能把伤势恢复个七七八八……
en_us: He used his inner vision to check on his wound and his emotions quickly improved. In such a short amount of time, the wound-recovery speed had already overtaken the amount he had healed through meditation by four to six hours. If at that moment he had enough black essence force, he estimated that within two and half minutes he would be able to heal his wounds by seventy to eighty percent...

source: 他再次奔走了数十丈距离，速度一下慢了下来，那黑色元力已经消耗完毕了，他刚想调动一丝黑色元力，继续加快速度却很快醒悟过来。
en_us: after running a few hundred feet, his speed rapidly dropped. The black essence force was exhausted. He wanted to use another wisp of the black essence force to boost his speed again, but he came to his senses quickly.

source: 他再次睁开了眼睛，感受着丹田角落内的存放的六缕黑色元力，他是越“看”越可爱，这可是他的宝贝呀，如果不是这黑色元力，今日绝对要坏事了。
en_us: He opened his eyes once again and could feel, in the corner of his dantian, the six strands of black essence force currently stored there. The more he "looked" at them, the cuter they seemed. After all, they were his babies, and if not for this black essence force, there would be much worse things happening today.

source: 他分明看见，击飞自己的是一道水柱。
en_us: He had clearly saw what struck him was a waterspout.

source: 他刚想上去帮忙，却又看到捧着一大堆古籍，一名身材修长高大的白发老人走进了屋子，将怀中的书堆到桌上，表情严肃地告诉他，这些秘籍里面绝对有一本适合他修炼。
en_us: Just as he made to assist her, a white-haired old man with a lanky frame entered the house carrying a large stack of ancient texts. Placing the books onto the table, the elderly man told Jiang Yi with a serious look on his face that these secret manuals were sure to have a martial art style he could practice.

source: 他刚才只修炼了一个多时辰，黑色元力只提炼出五缕，现在已经消耗了一缕，万一在风月楼发生冲突，他拿什么护身？
en_us: He had only cultivated for slightly more than two hours and had only extracted five wisps of black essence force. Now that he had expended one wisp, how was he to protect himself when conflict arose in Fengyue Brothel?

source: 他午饭都顾不上吃了，先是把十几枚废丹收集起来，上午由于是试验，柳长老倒是没有过多浪费药草，所以每一炉丹药也就三四枚。
en_us: Without eating his lunch, he decided to first gather the ten or so pills of the useless elixirs. As Elder Liu had been doing trials all morning, he did not waste too much of his medicinal herbs; thus every cauldron contained just three of four elixir pills.

source: 他又把丹田内唯一剩下的一缕黑色元力运转去了右手，他今天后面修炼出来的五缕黑色元力已经全部用完，如果这次还不能击退这铸鼎境三重的护卫，那么他和小奴只能等着受罪了……
en_us: he once again transferred black essence force, the last remaining strand in his dantian, towards his right hand. He had consumed all five strands of black essence force he had previously cultivated that day. If he still could not beat back that guard with power at the third stage of the Cast Tripod Realm, there was nothing Xiaonu and himself could do but to endure more incoming attacks...

source: 他双眼如电，死死锁定成扇形朝他掠来的三人，根据对方的动作，提前预算出对方要出的招式，要攻击的轨迹和速度，先一步踩着奇异的步法，朝左边绕去。
en_us: His two eyes were like electricity, firmly locking on to the three people who were sweeping towards him in a fan-shaped formation. Based on his opponents' actions, he predicted in advance the martial arts techniques to be taken by his opponents, their attack trajectories and their attack speeds. He then used a few fantastic foot movements in advance, moving towards the left to bypass their attacks.

source: 他双腿元力灌注，全力朝西门奔去同时侧耳聆听，背后那人果然快步追来。江逸狂奔一阵身形一转，陡然进了旁边的一个小巷内隐藏起来，等到身后的那人如一道狂风朝前方掠去，才快速转头朝江家南院狂奔而去。
en_us: Concentrating his essence force in his two legs, he raced towards the western gate with all his strength. At the same time, he strained his ears to listen for it. Sure enough, the person behind him had started chasing after him with quick footsteps. Jiang Yi ran like a madman for some time, before changing his direction and turning his body to abruptly enter a small alleyway to the side. He hid inside the alleyway. He waited for the person behind him to race past him like a strong gale, before hastily turning around and running crazily towards the southern courtyard of the Jiang Residence.

source: 他取出一个白色的小瓶，浑身都兴奋起来，这灵神丹可是人阶上品丹药，能辅助人快速修炼元力。而他的黑色元力能增幅药力，和药力融合后这灵神丹绝对可比地品丹药，把这十枚灵神丹全部炼化，足够他修炼到铸鼎境二重。
en_us: His entire body quivered with excitement, as he retrieved a small white bottle. The Spirit Pills inside were Man-tier superior-grade elixirs, after all, and could help one speed up the cultivation of essence force. On top of that, his black essence force could increase medical efficacies of any elixir - once it was merged with the medical efficacy of the Spirit Pill, that elixir would definitely be on par with an earth-tier elixir. Melting down all ten Spirit Pills would definitely be enough to help him cultivate his power level up to the second stage of the Cast Tripod Realm.

source: 他只是伸出一支右手，有些轻佻的指着林立，那红宝石在水晶灯光下，更是折射出纯净而耀眼的光亮。
en_us: He merely held out his right hand and pointed pettily at Lin Li. The ruby reflected a pure and dazzling light under the crystal chandeliers.

source: 他只是沉默了一会，果断的拒绝道：“多谢翊公子好意，在下身份低微怎么配得上凌雪小姐？”
en_us: After a moment of silence, Jiang Yi firmly turned him down, "I'm grateful for Young Master Yi's kindness, but as someone of humble birth, I couldn't possible be a good match for Young Mistress Lingxue."

source: 他只能咬牙死撑着，冷喝道：“你管我是谁家子弟？你们今日敢毒打我的侍女，这道理就算说到哪去我都不怕。”
en_us: He could only clench his fist and restrain himself. Instead, he coldly retorted, "Why do you care whose son of which family I come from? You people viciously beat up my maidservant today—anywhere you go to seek any justice, I will not be afraid to counter you."

source: 他只能疯狂的运转蓝色元力，咬牙全力朝风月楼冲去，一路上因为奔走得太快，都差点撞到几个人。
en_us: He could only crazily circulate the blue essence force as he clenched his teeth and rushed towards Fengyue Brothel. He nearly collided into a few passersby due to his hurry.

source: 他只花了三千年便成就帝位，号称史上耗时最短，同时也是最具武学智慧的大帝。
en_us: He only spent three thousand years to attain the throne. He experienced the shortest rise to power in history, and at the same time, he was the thearch with the best martial intelligence.

source: 他唯一的选择，只有安排好江家的事情，然后去武殿内潜伏数月，在武殿内虽然也有马家子弟，但他带着面具，本身还是江家一位不足轻重的子弟，谁能认出他？
en_us: His only choice was to sort out his affairs in the Jiang Clan, before hiding for a few months in the Martial Arts Hall. The fact that there were Ma Family descendants in the Martial Arts Hall notwithstanding, who could have recognized him, an insignificant member of the Jiang Clan, especially when he had a mask on?

source: 他回来的路上已经想清楚了，他必须安排好所有事情，然后潜伏数月，等实力强大了有自保之力才能四处行走。江家大院内很安全，但他和武殿有过约定，必须在那做陪练五年，一旦违约后果可比得罪马家严重多了……
en_us: He had thought things through on the way back: he had to get his affairs in order and go into hiding for several months. Once he had become strong enough to protect himself, only then would he be able to go wherever he pleased. Although he would be safe in the Jiang Clan courtyard, he had an agreement with the Martial Arts Hall and had to work as a sparring partner for five years. Turning back on that agreement would result in consequences far more severe than offending the Ma Family...

source: 他在江逸那呼啸而来的六个拳影上感受到危险，马飞就在身后，他不敢乱来只能先抵挡一下。等所有护卫围上来，江逸就再也无法伤到马公子了。只要马公子安全，他们就能全力对付江逸。
en_us: He had sensed danger from the six fist silhouettes that Jiang Yi hurtled at them. As Ma Fei was behind him, he dared not act impulsively and could only try to temporarily ward off the attack. When all the guards came forth, Jiang Yi would no longer be able to harm Young Master Ma, and when Young Master Ma's safety was secured, they could then give their all to deal with Jiang Yi.

source: 他坐镇天庭，统治诸界长达七千年，只因天帝无名，故世人根据他的武学境界至阳至极，在他的晚年尊称他为九阳天帝。
en_us: He presided over the Heavenly Court, ruling the various worlds for as long as seven thousand years. As the Celestial Thearch was nameless, people eventually addressed him as the Nine-Yang Celestial Thearch in his twilight years due to his extreme attainment in the martial realm of Yang.

source: 他大摇大摆的走进去，取出身上唯一的一片紫金叶子，在柜台上一拍，沉喝起来：“店家，给我来十枚灵神丹！”
en_us: He swaggered boldly into the store. Retrieving the one and only piece of purple gold leaf on his person, he slammed his hand on the counter-top and ordered loudly, "Storekeeper, bring me ten Spirit Pills!"

source: 他审问的对象，是一名看上去四十多岁的中年人，虽然眼睛已经肿了起来，不过在场魔法师中记性不错的，大多都还认得这中年人是谁。
en_us: He was interrogating a middle-aged man who appeared to be in his forties. His eyes were swollen, but the mages present who had good memory mostly recognized this middle-aged man.

source: 他家院门被一名穿着粗布长裙的少女跌跌撞撞的撞开了，那少女满脸的惊慌，一冲进来就大叫起来：“江逸少爷，江逸少爷！快出来，你家小奴被人打了，你还不去，怕是她命都没了……”
en_us: His yard's door had been slammed open by a young lady wearing a dress made of rough sackcloth. Her face was panic-stricken and the moment she charged in, she shouted, "Young Master Jiang Yi, Young Master Jiang Yi! Quick, come out, your Xiaonu is being beaten up! You had better come quickly before she loses her life…"

source: 他小心翼翼的将这丝黑色元力运转到左手的手少阴心经内，再缓缓运转丹田内的江水诀元力，朝左手涌去。
en_us: He carefully transferred the black essence force to the Shaoyin meridian in his left hand before slowly circulating the Jiang Water Art in his dantian and also sending it to his left hand.

source: 他屈身将小奴背上就大步朝屋子外冲去，准备直接从后院逃走。只要回到江家，这风月楼的人就算胆子再大也不敢去闹事的，怎么说江家是天羽城五大家族之一。
en_us: He bent down, lifted Xiaonu onto his back and charged out of the room with wide strides. He planned to escape from the backyard. Once he returned to the Jiang Clan, the people from Fengyue Brothel would not dare to cause a fuss in the family grounds no matter how gutsy they were. After all, the Jiang Clan was one of the top five great family clans in the Skyplume City.

source: 他左眼中黑光一闪，这个世界再次变样了，一切都变得那么清晰，而且……似乎时间真的变慢了。他看到眼前那只手掌还在拍来，不过速度明显慢了几倍，他还看到那护卫察觉到脚上的小奴，左脚一动正准备运转元力一把将小奴踹飞出去。
en_us: A flash of darkness flickered in his left eye as everything in his vision became very clear and vivid, as though the world had changed once again. On top of that… it seemed as though time had indeed slowed down. He observed the palm in front of his eyes still in the midst of slapping downwards, but moving at a speed several times slower than before. He also witnessed that guard realizing that Xiaonu was on his leg, and that his left leg was in the process of moving as he got ready to transfer his essence force there for a strong kick that would send Xiaonu flying.

source: 他左眼此刻视力变得恐怖，连带时间似乎也变慢了几分，所以他能轻松的看清楚对方手掌扫动的轨迹。也就能提前判断躲避开去，并且……寻找角度攻击！
en_us: The vision of his left eye changed an obscene amount, to the point that even time seemed to have slowed by several moments. As such, he was able to see clearly and with much ease the trajectory of the sweeping motion of his opponent's palms. This meant that he could determine in advance how to avoid the blow and, on top of that, even find the right angle to counter-attack!

source: 他已经不记得，加洛斯魔法公会有多久没这么热闹过了，最近二十年来，魔法公会虽然还是加洛斯城第一势力，但明眼人都知道，这只不过是因为最高议会的存在，如果失去了最高议会的支持，这个第一势力在瞬间就会分崩离析。
en_us: He no longer remembered how long it had been since the Jarrosus City had been so astir. For the last twenty years, the Guild of Magic had been the top influence in Jarrosus City. But those with discerning eyes knew that it was only because the Supreme Council still existed. Without the support of the Supreme Council, the guild would have fallen apart in an instant.

source: 他强烈抑制内心的激动，运转那缕丹田外的黑色元力环绕在龙形封印上。让他狂喜的不能自己的是——黑色元力开始缓缓消失，在龙形封印上的一枚符文也缓缓的消融，最终在黑色元力完全消耗后，符文再次少了一枚！
en_us: He strongly controlled the excitement in his heart and tried to circulate the strand of black essence force outside his dantian to surround the dragon seal. What left him in complete ecstasy was that as the black essence force gradually disappeared, a runic character on the dragon-shaped seal slowly dissipated as well. In the end, when the black essence force was completely consumed, the runic pattern had once again lost a single character!

source: 他强装的镇定，很快在黄裳小姐走进来后消失殆尽了，他扫了一眼这少女后目光立即移不开去了。江家有很多漂亮小姐，大小姐二小姐也长得人比花俏，但此刻和这黄裳小姐相比就感觉鲜花绿叶般，根本不是一个档次。
en_us: The calm demeanour he put on quickly disappeared to nothingness after the young lady dressed in yellow walked into the booth. Upon giving this young lady a glance, his gaze froze immediately. There were many pretty ladies in the Jiang Clan. The Eldest Young Mistress and the Second Young Mistress were as beautiful as flowers. However, at that moment, in comparison with this young lady wearing yellow robes, it was akin to comparing between fresh flowers and green leaves - they were at two completely different levels.

source: 他很后悔自己为什么要追进落日山脉，如果不追进落日山脉的话，就不会遇到利维坦猩猩，不遇到利维坦猩猩，自己就不会丢下伊娜一个人落荒而逃，追求伊娜的方法有很多，可自己却偏偏选了最笨的一条路。
en_us: He had utterly regretted chasing into the Sunset Mountains. He would not have encountered the Leviathan Gorilla if he had not entered the Sunset Mountains, and he would not have fled without taking Ina with him. There were many ways to win Ina's heart, but he had chosen the stupidest one.

source: 他很快就反应过来，顿时恼羞成怒，他竟被一个小孩子吓到了？当下抬手就是一拳，朝江逸冲去。
en_us: He responded very quickly to Jiang Yi; his shame immediately turning to rage. How could he be frightened off by just a small child? He raised his hand at once, posed in the shape of a fist, and swung it in the direction of Jiang Yi.

source: 他很清楚今日要想安然无恙的下山，只有拿下江如虎威慑众人，他的黑色元力已经用了三缕，一旦完全消耗干净就只能坐以待毙了。
en_us: He was well aware that if he wanted to come out of the Western Hills completely unscathed that day, he had no other option but to take down Jiang Ruhu and thereby deter the rest from attacking. He had already used up three wisps of his black essence forces. Once he completely consumed all of his black essence forces, he would have no other ending but be resigned to being hit to death.

source: 他很清楚的记得，自己第一次瞬发低级法术，是三十岁，刚刚成为一名魔导士的时候。
en_us: He remembered very clearly; when he first performed his low-levelled spell, he was thirty years old and had just became a mage.

source: 他心神一动，立即快速运转一缕黑色元力和经脉内的蓝色元力融合，朝左眼角的经脉运转而去。
en_us: With that thought, he hastily transferred a wisp of black essence force to his meridians, merging it with the blue essence force within them before circulating them towards the meridian at the corner of his left eye.

source: 他忘记了一点，他的双手此刻被江逸的缠丝手缠住了，他脚步一退双手又被缠住的，身体重心自然就不稳了，身子一晃差点摔倒，这下心神完全慌了。
en_us: He forgot that both his hands were entangled in Jiang Yi's Silk Hands. He tried to take a step back but his hands were still entangled, resulting in him being thrown off his center of gravity and losing his balance, almost falling down with a shake of his body. At this moment his mind was completely flustered.

source: 他快速转身，不退反进，双腿朝前方滑去，身子却突然后仰，双手如两根海藻般朝江松的双手缠去。有这黑色元力辅助，他能轻松判断出对方的攻击轨迹和速度，从而提前判断，躲避，回击。
en_us: He hastily turned around, not retreating but moving forward instead. With both legs aimed to the front, he slipped forward. However, his body suddenly bent back while both his hands moved in the direction of Jiang Song's hands and coiled around them like two pieces of seaweed. With the aid of black essence force, he could easily determine the opponent's attack trajectory and speed, and in turn use this information to judge, avoid or counter-attack in advance.

source: 他怎么也想不明白，事情为什么是这个样子……
en_us: He could not comprehend how things had become like this...

source: 他怎么也没有想到，让麦格雷尼陷入沉睡的，竟然是黄昏诅咒。
en_us: Never had he thought that it was the Twilight Curse that had put McGrenn to sleep.

source: 他怎么也没有想到，这世界上竟然有林立这种怪物。
en_us: He would never have imagined there'd been such a monstrous character like Lin Li in the world.

source: 他想弄清楚，自己以往的经验，在这个世界是不是同样适用。
en_us: He wanted to find out whether his past experiences could be applied in this world.

source: 他想起这个月丹药还没领，连忙爬起来胡乱整理了一下衣裳朝外面走去，一边走一边活动了左臂，发现伤势虽然没昨天那么严重了，不过还在隐隐作痛。
en_us: He remembered that the elixir for that month had not been received. He hurriedly got out of bed and absent-mindedly tidied up his robes before heading outside. As he walked, he moved his left shoulder, noticing that, while the conditions of his wound were not as serious as the day before, it was still stinging with pain.

source: 他慌忙爬起来，揭开炉盖一扫却苦笑不停，里面的两枚废丹……全炸了！
en_us: He hastily got up and opened the cauldron lid, giving the interior a glance. However, he could not help but laugh bitterly without stopping. The two useless elixirs in the cauldron... had complextely exploded to smithereens!

source: 他放下灵神丹盘坐入定，三个多时辰后准时清醒过来，立即吞服了一枚灵神丹，开始转修江水决。
en_us: He put down his Spirit Pills, sat cross-legged and started meditating. After more than six hours, he woke up punctually and, after immediately swallowing a Spirit Pill, started to practice the Jiang Water Art technique.

source: 他整整图谋了六千六百年，只为进入天庭的这一天！
en_us: He had conspired for 6600 years just for this day, the day he would enter the Heavenly Court!

source: 他无论如何也没想到，在葛瑞安最危险的时候，林立说出的竟然是这么一句话。
en_us: Never had he expected Lin Li to say such a thing when Gerian was at the most dangerous of times.

source: 他既然主动提起了这件事，那心里面肯定早就有了打算。
en_us: Since he had brought this up voluntarily, he had to have a plan in mind.

source: 他早早运转一缕黑色元力去了眼中，马飞那把剑刺来的速度和轨迹他预算得清清楚楚，自然不会傻乎乎的朝他拳头砸去。
en_us: Jiang Yi had already transferred a wisp of black essence force to his eyes earlier, and could hence clearly predict the speed and trajectory of Ma Fei's sword. He certainly was not foolish enough to take it on with his fist.

source: 他是江家子弟，万一给人看到他进出聚珍阁，还是去卖丹药！这很容易给人怀疑他偷炼丹房内的丹药出来卖的，所以他不得不小心些。
en_us: He is a descendant of the Jiang Clan. What if someone spotted him going into the Pearl Gathering Pavilion and, moreover, going to selling elixirs! This would easily raise people's suspicions of him stealing the elixirs from the alchemy lab and selling them outside. As such, he had to be more careful.

source: 他暗暗告诉自己要镇定，抬头望着那管事，漠然说道：“你要什么说法？”
en_us: He silently told himself to remain calm. He raised his head to look at the housekeeper and coldly asked, "How do you want to settle this?"

source: 他曾经想过是葛瑞安自己，也想过是年近三十的凯文，甚至还想过翡翠高塔内众多年纪老迈，却始终表现平庸的魔法师，可是他却绝没有想过，那人竟会是这个看起来还不满二十岁的年轻魔法师！
en_us: He had once thought it might be Gerian himself, or Kevin who was near his thirties. He had even thought it might be the mages outside the Emerald Tower, those who were well stricken in years but were average in their performance. But he had never expected it would be a young mage not even over the age of 20!

source: 他最近确实在烦这件事，自从配出奥法药剂之后，葛瑞安就一直在缠他，要他无论如何，也要弄出一些药剂来增强公会魔法师的实力，当时林立考虑了一下，也觉得很有点必要，如今魔法公会虽然已经彻底崛起，但影响力也只在加洛斯城内。
en_us: He had been really vexed by it lately. Ever since he had concocted the Arcane Magic Potion, Gerian had been pestering him to come up with some other potions no matter how to enhance the strength of the mages in the Guild of Magic. Lin Li had given it some thought at that time and felt it necessary as well. Although the Guild of Magic had ultimately risen, its influence was contained only in Jarrosus City.

source: 他有些奇怪的四处张望，却看见刚刚还跟他聊得分外投机的同僚，此时却一个个都离自己远远的，看那提心吊胆的表情，就好象生怕被瘟疫传染上了似的……
en_us: He looked around in puzzlement, only to see his colleagues who had been chatting amicably with him just a moment ago were all far away from him now. The expressions of fear on their faces were as if they were afraid of getting infected by the plague...

source: 他此刻经脉内的元力全是由江水诀形成的蓝色，再无一丝黑色存在。
en_us: At this moment, his meridians were all filled with blue essence force from the Jiang Water Art; not a sliver of black essence force remained.

source: 他沉吟一会，放下江如虎的腿，抬腿对着江如虎血肉模糊的脑袋踩去，身子凑过去，压低声音说道：“江如虎，你可知道我现在是什么境界？你可知道我为何能一拳砸飞江如鹰？你可知道为何我敢如此对你？实话告诉你把，我就是想把事情闹大，让整个江家都知道……我江逸不是废物！你们才是废物！”
en_us: He muttered deeply to himself for a moment, before letting go of Jiang Ruhu's leg. He raised his own leg and stepped down onto Jiang Ruhu's badly mutilated head. Moving his body close to Jiang Ruhu, he lowered his voice and quietly said, "Jiang Ruhu, do you know what power level in the Cast Tripod Realm I am at right now? Do you know how I was able to sned Jiang Ruying flying with just a single punch? Do you know why I dare to do this to you? To tell you the truth, I want to make things big, and let the entire Jiang Clan know that... I, Jiang Yi, am not a useless good-for-nothing! You guys are the good-for-nothing wastrels!"

source: 他沉吟了一阵，最终下定决心弄一弄，抵押在风月楼那块令牌，如一把悬浮在他头上的利剑般压得他透不过气来……
en_us: He heaved a deep sigh for a moment before finally making up his mind to give it a shot. The command token he had given to the Fengyue Brothel as collateral was etched in his mind like a sharp sword floating over his head, pressuring and stressing him out until he could not breathe...

source: 他沉吟了一阵，调集了一缕黑色元力去辅助疗伤，等那缕黑色元力消耗完后，他才连忙打坐运转无名功法。
en_us: He muttered to himself for a short moment before collecting a strand of black essence force to facilitate the healing of the wound. Only after consuming that strand of black essence force did he hastily sit cross-legged to work on the nameless cultivation technique again.

source: 他沉喝一声，拳头幻化出三个拳影，分别朝江如虎的脑袋，左肩，小腹砸去。
en_us: He shouted deeply and loudly as his fists transformed into three fist-like silhouette images, with each individually hitting in the direction of Jiang Ruhu's head, left shoulder and lower abdomen.

source: 他沉默了很久，再次问道：“杨管事，如果我和你们合作，是否就……失去了自由之身？”
en_us: He remained silent for a very long time, before finally asking once again, "Manager Yang, if I work with you, will I... lose my freedom?"

source: 他爆喝一声，元力从掌心运转而出，那把青色的短剑立即青光大盛，寒意逼人，他化掌为爪，那把短剑竟在他手心快速旋转起来，朝江逸拳头直刺而去。
en_us: Ma Fei roared, essence force flowing out from his palm. The teal-colored sword immediately shone even brighter, emitting a chilling aura. He drew his hand into a claw; the short sword began spinning rapidly on his palm before piercing through the air, aiming directly at Jiang Yi's fist.

source: 他爽是爽了，可就在他爽到极点的时候，却忽然看见林立抬起了右手。
en_us: He was satisfied, but just as his satisfaction reached the fullest, he saw Lin Li lifting his right hand.

source: 他猛然醒悟过来，吓得差点魂飞魄散。在他现在这个阶段，不同属性的元力是绝对不能同时运转的，否则一旦冲撞起来，不同属性元力在体内絮乱暴动的话，他全身经脉和血脉都有可能因此爆掉……
en_us: He abruptly realised his mistake and was scared out of his wits. In the condition he was in right now, essence force of different elements couldn’t be circulated together at the same time, otherwise they would clash and create disorder in the body. The meridians and blood vessels in his body would simply explode from the collisions…
